import 'package:flutter/material.dart';
import '../screens/course/course_detail_screen.dart';
import '../models/courses/course.dart';

class Game2DScreen extends StatelessWidget {
  final Course course;

  const Game2DScreen({super.key, required this.course});

  @override
  Widget build(BuildContext context) {
    return CourseDetailScreen(
      courseName: '2D Game Development',
      imagePath: 'Image/2d_gameDev-0.png',
      price: course.price,
      description:
          '### 🕹️ Розробка 2D ігор\n\n'
          'Цей курс допоможе вам опанувати створення **2D ігор** з нуля, '
          'використовуючи популярні рушії, як-от **Unity**, **Godot** чи **Flutter Flame**. '
          'Ви навчитеся створювати персонажів, анімації, рівні, керування та інтерактивні обʼєкти.\n\n'
          '### 📌 Що ви вивчите у цьому курсі?\n'
          '- ✅ **Основи створення 2D-ігор** з нуля\n'
          '- ✅ **Рух та фізика персонажів**\n'
          '- ✅ **Анімації, спрайти та партикли**\n'
          '- ✅ **Робота з тайлмапами та створення рівнів**\n'
          '- ✅ **Керування зіткненнями та взаємодіями**\n'
          '- ✅ **UI для 2D ігор (життя, очки, меню тощо)**\n'
          '- ✅ **Експорт готових ігор на мобільні платформи**\n\n'
          '### 🎯 Для кого цей курс?\n'
          '- ✅ Початківці, які хочуть створювати **просту гру самостійно**\n'
          '- ✅ Художники та аніматори, які хочуть втілити свої ідеї у геймдеві\n'
          '- ✅ Розробники, які хочуть розширити навички **2D-геймплею**\n\n'
          '### 🚀 Після проходження курсу ви зможете:\n'
          '- 🎨 **Створювати повноцінні 2D-ігри з інтерактивністю та UI**\n'
          '- 🛠️ **Використовувати рушії типу Unity, Godot або Flutter Flame**\n'
          '- 📱 **Запускати свої ігри на мобільних платформах та ділитися з друзями**\n\n'
          '🔥 **Створи свою першу 2D-гру вже сьогодні!**',
    );
  }
}
